benchmarks/lora/definitive_results/results_extras/extract_max_achievable_throughput_by_rank/qwen-2.5-7b-instruct/_1_8_/log_39466909.out
INFO 04-21 15:29:03 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=39615, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', tokenizer=None, num_prompts=8192, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/finding_maximum/extract_max_achievable_throughput_by_rank/qwen-2.5-7b-instruct/_1_8_', launch_server=True, server_args='--port=39615 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct" --max-num-seqs="2048" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching --enable-lora --dummy-lora-modules="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct/lora/lora-medical_dummy_rank_8" --max-loras=1 --max-lora-rank=8', server_init_time=1800, disable_log_stats=False, disable_loras_users=False, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset=None, synthetic_input_length=None, synthetic_output_length=None)
Server started
Models {'object': 'list', 'data': [{'id': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', 'object': 'model', 'created': 1776778302, 'owned_by': 'vllm', 'root': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', 'parent': None, 'max_model_len': 32768, 'permission': [{'id': 'modelperm-f6c9307bbb19446ea6601ccf944a4238', 'object': 'model_permission', 'created': 1776778302, 'allow_create_engine': False, 'allow_sampling': True, 'allow_logprobs': True, 'allow_search_indices': False, 'allow_view': True, 'allow_fine_tuning': False, 'organization': '*', 'group': None, 'is_blocking': False}]}, {'id': 'dummy-0', 'object': 'model', 'created': 1776778302, 'owned_by': 'vllm', 'root': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct/lora/lora-medical_dummy_rank_8', 'parent': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', 'max_model_len': None, 'permission': [{'id': 'modelperm-81cbf03388424ba48c53f3c5bacb5e75', 'object': 'model_permission', 'created': 1776778302, 'allow_create_engine': False, 'allow_sampling': True, 'allow_logprobs': True, 'allow_search_indices': False, 'allow_view': True, 'allow_fine_tuning': False, 'organization': '*', 'group': None, 'is_blocking': False}]}]}
Requests users. Values: ['0']. Counts: [8192]
Requests loras. Values: ['dummy-0']. Counts: [8192]
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8192      
Benchmark duration (s):                  217.58    
Total input tokens:                      1805281   
Total generated tokens:                  1596174   
Request throughput (req/s):              37.65     
Input token throughput (tok/s):          8297.22   
Output token throughput (tok/s):         7336.15   
---------------Time to First Token----------------
Mean TTFT (ms):                          90151.61  
Median TTFT (ms):                        88912.73  
P99 TTFT (ms):                           182732.59 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          112.88    
Median TPOT (ms):                        115.17    
P99 TPOT (ms):                           153.24    
---------------Inter-token Latency----------------
Mean ITL (ms):                           108.77    
Median ITL (ms):                         109.46    
P99 ITL (ms):                            143.70    
==================================================
Concurrent checker terminated
Server terminated